/provision env=feature
#### 🏗 Provisioned infrastructure on **feature**
- 🚧 Plan finished success

<details>
  <summary>

  #### 📖 Summary
  </summary>

  [0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
The remote workspace is configured to work with configuration at
aws relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Ignite/Ignite/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Ignite/Ignite

[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/threepoints/ignite/runs/run-Exw92pJtnvjC7auC[0m
[0m
Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.aws_iam_policy_document.amplify: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.amplify: Read complete after 0s [id=3761455492][0m
[0m[1maws_iam_role.amplify: Refreshing state... [id=amplify][0m
[0m[1maws_amplify_app.application: Refreshing state... [id=d119ihvqdpkos6][0m
[0m[1maws_amplify_branch.environment: Refreshing state... [id=d119ihvqdpkos6/development][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_amplify_app.application[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_amplify_app" "application" {
      [33m~[0m [0m[1m[0mauto_branch_creation_patterns[0m[0m = [
          [31m-[0m [0m"*",
          [31m-[0m [0m"*/**",
        ]
        [1m[0mid[0m[0m                            = "d119ihvqdpkos6"
        [1m[0mname[0m[0m                          = "ignite"
        [1m[0mtags[0m[0m                          = {
            "application" = "ignite"
        }
        [90m# (16 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_amplify_branch.environment[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_amplify_branch" "environment" {
      [33m~[0m [0m[1m[0marn[0m[0m                         = "arn:aws:amplify:us-east-1:630399362247:apps/d119ihvqdpkos6/branches/development" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0massociated_resources[0m[0m        = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mbranch_name[0m[0m                 = "development" [33m->[0m [0m"fix/issue-12/dashboard" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mcustom_domains[0m[0m              = [] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mdestination_branch[0m[0m          = (known after apply)
      [33m~[0m [0m[1m[0mdisplay_name[0m[0m                = "development" [33m->[0m [0m"dashboard"
      [31m-[0m [0m[1m[0menable_basic_auth[0m[0m           = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_notification[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_performance_mode[0m[0m     = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_pull_request_preview[0m[0m = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menvironment_variables[0m[0m       = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                          = "d119ihvqdpkos6/development" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0msource_branch[0m[0m               = (known after apply)
      [31m-[0m [0m[1m[0mstage[0m[0m                       = "NONE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtags[0m[0m                        = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m                    = {} [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mttl[0m[0m                         = "5" [90m->[0m [0m[90mnull[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0menv_domain[0m[0m = "https://development.d119ihvqdpkos6.amplifyapp.com" [33m->[0m [0m"https://dashboard.d119ihvqdpkos6.amplifyapp.com"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "env_mode" but a value
[33m│[0m [0mwas found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Exw92pJtnvjC7auC/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "env_stage" but a value
[33m│[0m [0mwas found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Exw92pJtnvjC7auC/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

</details>